Repository: pypi-data/pypi-mirror-337
Catalog: packages/fiduswriter/fiduswriter-4.0.3.tar.gz/fiduswriter-4.0.3/fiduswriter/gitrepo_export/locale/*/LC_MESSAGES/djangojs.po
Languages: bg, de, es, fr, it

source: There is no github repository registered for the book:
bg: Няма регистрирано хранилище на github за книгата:
de: Für das Buch ist kein Github-Repository registriert:
es: No hay ningún repositorio de github registrado para el libro:
fr: Il n'y a pas de dépôt github enregistré pour le livre :
it: Non esiste un repository github registrato per il libro:

source: You do not have access to the repository:
bg: Нямате достъп до хранилището:
de: Sie haben keinen Zugriff auf das Repository:
es: No tienes acceso al repositorio:
fr: Vous n'avez pas accès au référentiel :
it: Non hai accesso al repository:

source: Book publishing to Github initiated.
bg: Инициирано издаване на книги в Github.
de: Buchveröffentlichung auf Github eingeleitet.
fr: Publication de livres sur Github initiée.
it: Iniziata la pubblicazione di libri su Github.

source: Book already up to date in repository.
bg: Резервирайте вече актуално в хранилището.
de: Buch ist bereits auf dem neuesten Stand im Repository.
fr: Livre déjà à jour dans le référentiel.
it: Prenota gi√† aggiornato nel repository.

source: Could not publish book to repository.
bg: Не можа да публикува книга в хранилището.
de: Buch konnte nicht im Repository veröffentlicht werden.
es: No se pudo publicar el libro en el repositorio.
fr: Impossible de publier le livre dans le référentiel.
it: Impossibile pubblicare il libro nel repository.

source: Could not publish some parts of book to repository.
bg: Не можах да публикувам някои части от книгата в хранилището.
de: Einige Teile des Buchs konnten nicht im Repository veröffentlicht werden.
es: No se pudieron publicar algunas partes del libro en el repositorio.
fr: Impossible de publier certaines parties du livre dans le référentiel.
it: Impossibile pubblicare alcune parti del libro nel repository.

source: Book published to repository successfully!
bg: Книгата е публикувана успешно в хранилището!
de: Buch erfolgreich im Repository veröffentlicht!
es: ¡Libro publicado en el repositorio con éxito!
fr: Livre publié dans le référentiel avec succès !
it: Libro pubblicato nel repository con successo!

source: Book updated in repository successfully!
bg: Книгата е актуализирана в хранилището успешно!
de: Buch erfolgreich im Repository aktualisiert!
es: ¡Libro actualizado en el repositorio con éxito!
fr: Livre mis à jour dans le référentiel avec succès !
it: Libro aggiornato nel repository con successo!

source: Export to Github
bg: Експортирайте в Github
de: Nach Github exportieren
es: Exportar a Github
fr: Exporter vers Github
it: Esporta in Github

source: Export selected to Github.
bg: Експортирането е избрано в Github.
de: Ausgewählte nach Github exportieren.
fr: Exporter la sélection vers Github.
it: Esporta selezionato in Github.

source: Github related settings
bg: Настройки, свързани с Github
de: Github-bezogene Einstellungen
es: Configuraciones relacionadas con Github
fr: Paramètres liés à Github
it: Impostazioni relative a Github

source: Github repository
bg: Хранилище на Github
es: Repositorio de Github
fr: Dépôt Github
it: Repository Github

source: Select github repository to export to
bg: Изберете хранилището на github, в което да експортирате
de: Wählen Sie das Github-Repository aus, in das exportiert werden soll
es: Seleccione el repositorio de github para exportar
fr: Sélectionnez le référentiel github vers lequel exporter
it: Seleziona il repository github in cui esportare

source: Export EPUB
bg: Експортиране на EPUB
de: EPUB exportieren
es: Exportar EPUB
fr: Exporter l'EPUB
it: Esporta EPUB

source: Export unpacked EPUB
bg: Експортирайте разопакован EPUB
de: Entpackte EPUB exportieren
es: Exportar EPUB descomprimido
fr: Exporter l'EPUB décompressé
it: Esporta EPUB decompresso

source: Export HTML
bg: Експортиране на HTML
de: HTML exportieren
es: Exportar HTML
fr: Exporter le HTML
it: Esporta HTML

source: Export LaTeX
bg: Експортирайте LaTeX
de: LaTeX exportieren
es: Exportar LaTeX
fr: Exporter LaTeX
it: Esporta LaTeX

source: Update from Fidus Writer
bg: Актуализация от Fidus Writer
de: Update von Fidus Writer
es: Actualización desde Fidus Writer
fr: Mise à jour de Fidus Writer
it: Aggiornamento da Fidus Writer
