Repository: pypi-data/pypi-mirror-337
Catalog: packages/pyams-thesaurus/pyams_thesaurus-2.2.0.tar.gz/pyams_thesaurus-2.2.0/src/pyams_thesaurus/locales/*/LC_MESSAGES/pyams_thesaurus.po
Languages: fr

source: Create thesaurus
fr: Créer un thésaurus

source: Manage thesaurus properties
fr: Gérer les propriétés d'un thésaurus

source: Manage thesaurus content
fr: Gérer le contenu d'un thésaurus

source: Manage thesaurus extract
fr: Gérer les extraits d'un thésaurus

source: Thesaurus administrator (role)
fr: Administrateur de thésaurus (rôle)

source: Thesaurus content manager (role)
fr: Gestionnaire de thésaurus (rôle)

source: Thesaurus extract manager (role)
fr: Gestionnaire d'extrait de thésaurus (rôle)

source: Term not found
fr: Ce terme est introuvable.

source: Term can't be deleted
fr: Ce terme ne peut pas être supprimé.

source: Thesaurus: {}
fr: Thésaurus : {}

source: Term: {}
fr: Terme : {}

source: Terms tree
fr: Termes

source: Terms tree view
fr: Arborescence des termes

source: Import terms
fr: Importer des termes

source: Cancel
fr: Annuler

source: Import new terms
fr: Import de nouveaux termes

source: Terms import settings
fr: Paramètres de l'import

source: -- automatic detection -- (if available)
fr: -- détection automatique -- (si disponible)

source: Export terms
fr: Exporter les termes

source: terms-export-button
fr: Exporter les termes

source: terms-export-title
fr: Export des termes

source: Terms export settings
fr: Paramètres de l'export

source: Thesaurus extracts
fr: Extraits du thésaurus

source: Display extract terms
fr: Afficher les termes de l'extrait

source: Show/hide extract
fr: Afficher/masquer l'extrait

source: Another extract is already registered with this name!
fr: Un autre extrait est déjà enregistré sous ce nom !

source: Add extract
fr: Ajouter un extrait

source: New thesaurus extract
fr: Nouvel extrait du thésaurus

source: New extract properties
fr: Propriétés du nouvel extrait

source: Clone thesaurus extract
fr: Dupliquer l'extrait

source: Thesaurus extract: {}
fr: Extrait du thésaurus : {}

source: Extract properties
fr: Propriétés de l'extrait

source: Extract roles
fr: Rôles de l'extrait

source: Extract terms
fr: Termes de l'extrait

source: Thesaurus container
fr: Thésaurus

source: Thesaurus
fr: Thésaurus

source: Thesaurus list
fr: Liste des thésaurus

source: List of thesaurus
fr: Liste des thésaurus

source: Properties
fr: Propriétés

source: Thesaurus manager properties
fr: Propriétés du gestionnaire de thésaurus

source: Thesaurus terms
fr: Termes du thésaurus

source: Test thesaurus widgets
fr: Test du thésaurus

source: Thesaurus test form
fr: Test d'utilisation du thésaurus

source: Thesaurus widget test
fr: Test de widgets du thésaurus

source: Another thesaurus is already registered with this name!
fr: Un autre thésaurus est déjà enregistré sous ce nom !

source: New thesaurus properties
fr: Propriétés du nouveau thésaurus

source: Add thesaurus
fr: Ajouter un thésaurus

source: New thesaurus
fr: Nouveau thésaurus

source: Clone thesaurus
fr: Dupliquer le thésaurus

source: Create thesaurus clone
fr: Duplication d'un thésaurus

source: Thesaurus properties
fr: Propriétés du thésaurus

source: Add term
fr: Ajouter un terme

source: New term
fr: Nouveau terme

source: New term properties
fr: Propriétés du nouveau terme

source: Delete term
fr: Supprimer le terme

source: Thesaurus term properties
fr: Propriétés d'un terme

source: Thesaurus term was deleted successfully.
fr: Le terme a été supprimé du thésaurus

source: No selected term
fr: Aucun terme sélectionné

source: Search term...
fr: Rechercher un terme...

source: Thesaurus name
fr: Nom du thésaurus

source: Name of the registered thesaurus
fr: Nom sous lequel le thésaurus sera enregistré

source: Input data
fr: Données à importer

source: Input file containing thesaurus data
fr: Fichier contenant les données du thésaurus à importer

source: File format
fr: Format du fichier

source: This list contains available thesauri loaders
fr: Sélectionner le format de fichier dans la liste des formats pris en charge

source: Import synonyms?
fr: Importer les synonymes

source: If 'No', synonyms will not be imported into loaded thesaurus
fr: Si 'non', les synonymes ne seront pas importés dans le thésaurus

source: Content language
fr: Langue du contenu

source: Select file language, for formats which don't provide it internally
fr: Sélectionner la langue si le format sélectionné ne prend pas en charge cette information

source: File encoding
fr: Encodage

source: Select file encoding, for formats which don't provide it internally
fr: Sélectionner l'encodage si le format ne prend pas en charge cette information

source: Clear before merge ?
fr: Effacer avant l'import

source: If 'yes', thesaurus will be cleared before re-importing file contents
fr: Si 'oui', le contenu du thésaurus sera effacé avant l'import du nouveau contenu

source: Auto-added conflict suffix
fr: Suffixe automatique

source: If you want to prevent imports conflicts, you can provide a suffix which will be added automatically to conflicting terms
fr: Si vous voulez empêcher que des conflits se produisent lors de l'import de nouveaux termes, vous pouvez fournir un suffixe qui sera ajouté automatiquement aux termes qui entrent en conflit avec des termes déjà présents dans le thésaurus

source: Export file name
fr: Nom du fichier d'export

source: Full file name, including extension
fr: Nom du fichier à exporter, en intégrant son extension

source: Export file format
fr: Format d'export

source: This list contains available thesauri exporters
fr: Sélectionnez une option parmi la liste des formats disponibles

source: Extract to export
fr: Extrait à exporter

source: You can choose to export only an extract of the thesaurus
fr: Si vous souhaitez n'exporter qu'un extrait du thésaurus, vous pouvez le sélectionner ici

source: Extension name
fr: Nom de l'extension

source: User name given to the extension
fr: Nom donné à l'extension

source: Extension marker interface
fr: Interface de marquage

source: Extension target view name
fr: Vue cible

source: Extension icon CSS class
fr: Classe CSS

source: Title
fr: Titre

source: Long title for this thesaurus
fr: Libellé long de ce thésaurus

source: Subject
fr: Contenu

source: Language
fr: Langue

source: Thesaurus's language
fr: Langue des termes du thésaurus

source: Creator
fr: Créateur

source: Publisher
fr: Éditeur

source: Creation date
fr: Date de création

source: Thesaurus top-terms
fr: Termes de premier niveau

source: List of top thesaurus terms, placed at first level
fr: Liste des termes de premier niveau du thésaurus

source: Thesaurus catalog
fr: Catalogue

source: Inner thesaurus catalog, used for full-text indexing
fr: Catalogue interne du thésaurus utilisé pour la recherche full-text

source: Administrators
fr: Administrateurs

source: List of thesaurus's administrators
fr: Les administrateurs sont autorisés à gérer toutes les propriétés et le contenu d'un thésaurus

source: Contents managers
fr: Contributeurs

source: List of thesaurus's contents contributors
fr: Les contributeurs sont habilités à gérer uniquement les termes d'un thésaurus

source: Access menu from home
fr: Ajouter un accès depuis l'accueil

source: If 'yes', a menu will be displayed to get access to thesaurus from site admin home page
fr: Si 'oui', un menu d'accès au gestionnaire de thésaurus sera ajouté depuis la page d'accueil de l'interface d'administration du site

source: Extract name
fr: Nom de l'extrait

source: Abbreviation
fr: Abréviation

source: Short abbreviation used to distinguish the extract
fr: Courte abréviation utilisée pour identifier l'extrait

source: Extract color
fr: Couleur

source: A color associated with this extract
fr: Couleur associée à cet extrait

source: Extract managers
fr: Gestionnaires

source: List of principals which can manage extract contents
fr: Liste de mandataires autorisés à gérer le contenu de l'extrait

source: Thesaurus extract
fr: Nom de l'extrait

source: Candidate
fr: Candidat

source: Published
fr: Publié

source: Archived
fr: Archivé

source: Term label
fr: Libellé

source: Full keyword for the given term
fr: Libellé complet du terme

source: '/' character is forbidden in term's label
fr: Le caractère '/' n'est pas autorisé dans le libellé d'un terme

source: Alternate label
fr: Libellé de substitution

source: Not to be confused with synonyms 'usage' label, given below...
fr: S'il est renseigné, ce libellé sera utilisé à la place du "Libellé" dans les composants de sélection des termes

source: Definition
fr: Définition

source: Long definition, mostly for complicated terms
fr: Définition complète, utilisée principalement pour les termes complexes

source: Term's application note
fr: Note d'application

source: Application note for the given term
fr: Directives d'applications éventuelles de ce terme

source: Generic term
fr: Terme générique

source: Parent generic term of the current term
fr: Terme de rattachement de ce terme

source: Order
fr: Ordre

source: Term's position between it's siblings; default terms order is alphabetical
fr: Position du terme parmi ses termes frères ; lorsqu'il n'est pas spécifié, l'ordre par défaut est alphabétique

source: Specifics terms
fr: Termes spécifiques

source: Child more specifics terms of the current term
fr: Autres termes rattachés à ce terme en tant que terme générique

source: Associated terms
fr: Termes associés

source: Other terms associated to the current term
fr: Autres termes associés à ce terme

source: Usage
fr: Terme d'usage

source: For synonyms, specify here the term's descriptor to use
fr: Dans le cas de synonymes, le terme d'usage est le terme 'officiel' à utiliser

source: Synonyms
fr: Synonymes

source: For a given allowed descriptor, specify here the list of synonyms
fr: Autres synonymes rattachés à ce terme en tant que terme d'usage

source: A term can't be a synonym and attached to a generic term
fr: Un terme ne peut pas être un synonyme et attaché à un terme générique

source: A term used as synonym can't have it's own synonyms (all synonyms should be attached to the descriptor)
fr: Un terme défini comme synonyme ne peut pas avoir ses propres synonymes (tous les synonymes devraient être rattachés au même terme principal)

source: Extracts
fr: Extraits

source: List of thesaurus extracts including this term
fr: Liste des extraits du thésaurus incluant ce terme

source: List of available extensions applied to this term
fr: Liste des extensions disponibles appliquées à ce terme

source: Status
fr: Statut

source: Term status
fr: Statut du terme

source: Micro-thesaurus?
fr: Micro-thésaurus

source: Is the term part of a micro-thesaurus?
fr: Indique si le terme fait partie d'un micro-thésaurus

source: First level parent
fr: Parent de niveau 1

source: Parent at level 1 of the current term, or None
fr: Parent de niveau 1 de ce terme ; non renseigné dans le cas des synonymes

source: Modification date
fr: Date de modification

source: Include term parents into index values
fr: Inclure les termes parents dans les valeurs de l'index

source: Include term synonyms into index values
fr: Inclure les synonymes dans les valeurs de l'index

source: Rich text description
fr: Texte enrichi

source: HTML content
fr: Contenu HTML

source: Associated HTML description
fr: Description associée au terme

source: HTML description
fr: Description HTML
