Repository: pypi-data/pypi-mirror-337
Catalog: packages/fiduswriter/fiduswriter-4.0.2.tar.gz/fiduswriter-4.0.2/fiduswriter/gitrepo_export/locale/*/LC_MESSAGES/djangojs.po
Languages: pt_br

source: There is no github repository registered for the book:
pt_br: Não há repositório github registrado para o livro:

source: You do not have access to the repository:
pt_br: Você não tem acesso ao repositório:

source: Book publishing to Github initiated.
pt_br: A publicação do livro no Github foi iniciada.

source: Book already up to date in repository.
pt_br: Livro já atualizado no repositório.

source: Could not publish book to repository.
pt_br: Não foi possível publicar o livro no repositório.

source: Could not publish some parts of book to repository.
pt_br: Não foi possível publicar algumas partes do livro no repositório.

source: Book published to repository successfully!
pt_br: Livro publicado no repositório com sucesso!

source: Book updated in repository successfully!
pt_br: Livro atualizado no repositório com sucesso!

source: Export to Github
pt_br: Exportar para Github

source: Export selected to Github.
pt_br: Exportar selecionados para o Github.

source: Github related settings
pt_br: Configurações relacionadas ao Github

source: Github repository
pt_br: Repositório Github

source: Select github repository to export to
pt_br: Selecione o repositório github para exportar

source: Export EPUB
pt_br: Exportar EPUB

source: Export unpacked EPUB
pt_br: Exportar EPUB descompactado

source: Export HTML
pt_br: Exportar HTML

source: Export LaTeX
pt_br: Exportar LaTeX

source: Update from Fidus Writer
pt_br: Atualização do escritor Fidus
